// задачник Абрамяна. for 2
// Даны два целых числа A и B (A < B). Вывести в порядке возрастания все
// задачник Абрамяна. for 3
//Даны два целых числа A и B (A < B). Вывести в порядке убывания все
//целые числа, расположенные между A и B (не включая числа A и B), а
//также количество N этих чисел.

#include <stdio.h>
int main(){
	int a, b;
	int i;
	int n = 0;
	scanf("%d", &a);
	scanf("%d", &b);
	for (i = b; i >= a; i = i - 1) {
		printf("%d ", i);
		n = n + 1;
	}
	printf("\n", n);
	
	return 0;
	
	
	
	
	
	
}
